STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_ramcfg.h
#if defined(LL_RAMCFG_WRP_PAGE_32)
/**
  * @brief  Enable the ramcfg write protection for the given page.
  * @rmtoll WPR2           WPR2           LL_RAMCFG_EnablePageWRP_32_63
  * @param  p_ramcfg RAMCFG instance
  * @param  page_msk
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_RAMCFG_WRP_PAGE_32
  *         @arg @ref LL_RAMCFG_WRP_PAGE_33
  *         @arg @ref LL_RAMCFG_WRP_PAGE_34
  *         @arg @ref LL_RAMCFG_WRP_PAGE_35
  *         @arg @ref LL_RAMCFG_WRP_PAGE_36
  *         @arg @ref LL_RAMCFG_WRP_PAGE_37
  *         @arg @ref LL_RAMCFG_WRP_PAGE_38
  *         @arg @ref LL_RAMCFG_WRP_PAGE_39
  *         @arg @ref LL_RAMCFG_WRP_PAGE_40
  *         @arg @ref LL_RAMCFG_WRP_PAGE_41
  *         @arg @ref LL_RAMCFG_WRP_PAGE_42
  *         @arg @ref LL_RAMCFG_WRP_PAGE_43
  *         @arg @ref LL_RAMCFG_WRP_PAGE_44
  *         @arg @ref LL_RAMCFG_WRP_PAGE_45
  *         @arg @ref LL_RAMCFG_WRP_PAGE_46
  *         @arg @ref LL_RAMCFG_WRP_PAGE_47
  *         @arg @ref LL_RAMCFG_WRP_PAGE_48
  *         @arg @ref LL_RAMCFG_WRP_PAGE_49
  *         @arg @ref LL_RAMCFG_WRP_PAGE_50
  *         @arg @ref LL_RAMCFG_WRP_PAGE_51
  *         @arg @ref LL_RAMCFG_WRP_PAGE_52
  *         @arg @ref LL_RAMCFG_WRP_PAGE_53
  *         @arg @ref LL_RAMCFG_WRP_PAGE_54
  *         @arg @ref LL_RAMCFG_WRP_PAGE_55
  *         @arg @ref LL_RAMCFG_WRP_PAGE_56
  *         @arg @ref LL_RAMCFG_WRP_PAGE_57
  *         @arg @ref LL_RAMCFG_WRP_PAGE_58
  *         @arg @ref LL_RAMCFG_WRP_PAGE_59
  *         @arg @ref LL_RAMCFG_WRP_PAGE_60
  *         @arg @ref LL_RAMCFG_WRP_PAGE_61
  *         @arg @ref LL_RAMCFG_WRP_PAGE_62
  *         @arg @ref LL_RAMCFG_WRP_PAGE_63
  */
__STATIC_INLINE void LL_RAMCFG_EnablePageWRP_32_63(RAMCFG_TypeDef *p_ramcfg, uint32_t page_msk)
{
  SET_BIT(p_ramcfg->WPR2, page_msk);
}

/**
  * @brief  Check the ramcfg write protection state for the given page.
  * @rmtoll WPR2           WPR2           LL_RAMCFG_IsEnabledPageWRP_32_63
  * @param  p_ramcfg RAMCFG instance
  * @param  page
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_RAMCFG_WRP_PAGE_32
  *         @arg @ref LL_RAMCFG_WRP_PAGE_33
  *         @arg @ref LL_RAMCFG_WRP_PAGE_34
  *         @arg @ref LL_RAMCFG_WRP_PAGE_35
  *         @arg @ref LL_RAMCFG_WRP_PAGE_36
  *         @arg @ref LL_RAMCFG_WRP_PAGE_37
  *         @arg @ref LL_RAMCFG_WRP_PAGE_38
  *         @arg @ref LL_RAMCFG_WRP_PAGE_39
  *         @arg @ref LL_RAMCFG_WRP_PAGE_40
  *         @arg @ref LL_RAMCFG_WRP_PAGE_41
  *         @arg @ref LL_RAMCFG_WRP_PAGE_42
  *         @arg @ref LL_RAMCFG_WRP_PAGE_43
  *         @arg @ref LL_RAMCFG_WRP_PAGE_44
  *         @arg @ref LL_RAMCFG_WRP_PAGE_45
  *         @arg @ref LL_RAMCFG_WRP_PAGE_46
  *         @arg @ref LL_RAMCFG_WRP_PAGE_47
  *         @arg @ref LL_RAMCFG_WRP_PAGE_48
  *         @arg @ref LL_RAMCFG_WRP_PAGE_49
  *         @arg @ref LL_RAMCFG_WRP_PAGE_50
  *         @arg @ref LL_RAMCFG_WRP_PAGE_51
  *         @arg @ref LL_RAMCFG_WRP_PAGE_52
  *         @arg @ref LL_RAMCFG_WRP_PAGE_53
  *         @arg @ref LL_RAMCFG_WRP_PAGE_54
  *         @arg @ref LL_RAMCFG_WRP_PAGE_55
  *         @arg @ref LL_RAMCFG_WRP_PAGE_56
  *         @arg @ref LL_RAMCFG_WRP_PAGE_57
  *         @arg @ref LL_RAMCFG_WRP_PAGE_58
  *         @arg @ref LL_RAMCFG_WRP_PAGE_59
  *         @arg @ref LL_RAMCFG_WRP_PAGE_60
  *         @arg @ref LL_RAMCFG_WRP_PAGE_61
  *         @arg @ref LL_RAMCFG_WRP_PAGE_62
  *         @arg @ref LL_RAMCFG_WRP_PAGE_63
  * @return State of the selected page (1 : write protected, 0 not write protected)
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsEnabledPageWRP_32_63(const RAMCFG_TypeDef *p_ramcfg, uint32_t page)
{
  return ((((uint32_t)READ_BIT(p_ramcfg->WPR2, page)) == page) ? 1U : 0U);
}

/**
  * @brief  Get the ramcfg write protection for the given page.
  * @rmtoll WPR2           WPR2           LL_RAMCFG_GetPageWRP_32_63
  * @param  p_ramcfg RAMCFG instance
  * @param  page_msk
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_RAMCFG_WRP_PAGE_32
  *         @arg @ref LL_RAMCFG_WRP_PAGE_33
  *         @arg @ref LL_RAMCFG_WRP_PAGE_34
  *         @arg @ref LL_RAMCFG_WRP_PAGE_35
  *         @arg @ref LL_RAMCFG_WRP_PAGE_36
  *         @arg @ref LL_RAMCFG_WRP_PAGE_37
  *         @arg @ref LL_RAMCFG_WRP_PAGE_38
  *         @arg @ref LL_RAMCFG_WRP_PAGE_39
  *         @arg @ref LL_RAMCFG_WRP_PAGE_40
  *         @arg @ref LL_RAMCFG_WRP_PAGE_41
  *         @arg @ref LL_RAMCFG_WRP_PAGE_42
  *         @arg @ref LL_RAMCFG_WRP_PAGE_43
  *         @arg @ref LL_RAMCFG_WRP_PAGE_44
  *         @arg @ref LL_RAMCFG_WRP_PAGE_45
  *         @arg @ref LL_RAMCFG_WRP_PAGE_46
  *         @arg @ref LL_RAMCFG_WRP_PAGE_47
  *         @arg @ref LL_RAMCFG_WRP_PAGE_48
  *         @arg @ref LL_RAMCFG_WRP_PAGE_49
  *         @arg @ref LL_RAMCFG_WRP_PAGE_50
  *         @arg @ref LL_RAMCFG_WRP_PAGE_51
  *         @arg @ref LL_RAMCFG_WRP_PAGE_52
  *         @arg @ref LL_RAMCFG_WRP_PAGE_53
  *         @arg @ref LL_RAMCFG_WRP_PAGE_54
  *         @arg @ref LL_RAMCFG_WRP_PAGE_55
  *         @arg @ref LL_RAMCFG_WRP_PAGE_56
  *         @arg @ref LL_RAMCFG_WRP_PAGE_57
  *         @arg @ref LL_RAMCFG_WRP_PAGE_58
  *         @arg @ref LL_RAMCFG_WRP_PAGE_59
  *         @arg @ref LL_RAMCFG_WRP_PAGE_60
  *         @arg @ref LL_RAMCFG_WRP_PAGE_61
  *         @arg @ref LL_RAMCFG_WRP_PAGE_62
  *         @arg @ref LL_RAMCFG_WRP_PAGE_63
  * @return The return value can be a 0x00000000U or combination of the following values :
  *         @arg @ref LL_RAMCFG_WRP_PAGE_32
  *         @arg @ref LL_RAMCFG_WRP_PAGE_33
  *         @arg @ref LL_RAMCFG_WRP_PAGE_34
  *         @arg @ref LL_RAMCFG_WRP_PAGE_35
  *         @arg @ref LL_RAMCFG_WRP_PAGE_36
  *         @arg @ref LL_RAMCFG_WRP_PAGE_37
  *         @arg @ref LL_RAMCFG_WRP_PAGE_38
  *         @arg @ref LL_RAMCFG_WRP_PAGE_39
  *         @arg @ref LL_RAMCFG_WRP_PAGE_40
  *         @arg @ref LL_RAMCFG_WRP_PAGE_41
  *         @arg @ref LL_RAMCFG_WRP_PAGE_42
  *         @arg @ref LL_RAMCFG_WRP_PAGE_43
  *         @arg @ref LL_RAMCFG_WRP_PAGE_44
  *         @arg @ref LL_RAMCFG_WRP_PAGE_45
  *         @arg @ref LL_RAMCFG_WRP_PAGE_46
  *         @arg @ref LL_RAMCFG_WRP_PAGE_47
  *         @arg @ref LL_RAMCFG_WRP_PAGE_48
  *         @arg @ref LL_RAMCFG_WRP_PAGE_49
  *         @arg @ref LL_RAMCFG_WRP_PAGE_50
  *         @arg @ref LL_RAMCFG_WRP_PAGE_51
  *         @arg @ref LL_RAMCFG_WRP_PAGE_52
  *         @arg @ref LL_RAMCFG_WRP_PAGE_53
  *         @arg @ref LL_RAMCFG_WRP_PAGE_54
  *         @arg @ref LL_RAMCFG_WRP_PAGE_55
  *         @arg @ref LL_RAMCFG_WRP_PAGE_56
  *         @arg @ref LL_RAMCFG_WRP_PAGE_57
  *         @arg @ref LL_RAMCFG_WRP_PAGE_58
  *         @arg @ref LL_RAMCFG_WRP_PAGE_59
  *         @arg @ref LL_RAMCFG_WRP_PAGE_60
  *         @arg @ref LL_RAMCFG_WRP_PAGE_61
  *         @arg @ref LL_RAMCFG_WRP_PAGE_62
  *         @arg @ref LL_RAMCFG_WRP_PAGE_63
  */
__STATIC_INLINE uint32_t LL_RAMCFG_GetPageWRP_32_63(const RAMCFG_TypeDef *p_ramcfg, uint32_t page_msk)
{
  return ((uint32_t)READ_BIT(p_ramcfg->WPR2, page_msk));
}
#endif /* LL_RAMCFG_WRP_PAGE_32 */

/**
  * @brief  Set the ramcfg unlock key for the ECC mechanism.
  * @rmtoll ECCKEY           ECCKEY           LL_RAMCFG_SetECCKey
  * @param  p_ramcfg RAMCFG instance
  * @param  key
  *         This parameter must respect the following order:
  *         @arg @ref LL_RAMCFG_ECC_KEY_1
  *         @arg @ref LL_RAMCFG_ECC_KEY_2
  */
__STATIC_INLINE void LL_RAMCFG_SetECCKey(RAMCFG_TypeDef *p_ramcfg, uint32_t key)
{
  WRITE_REG(p_ramcfg->ECCKEY, key);
}

/**
  * @brief  Set the ramcfg unlock key for the Erase operation.
  * @rmtoll ERKEYR           ERASEKEY           LL_RAMCFG_SetEraseKey
  * @param  p_ramcfg RAMCFG instance
  * @param  key
  *         This parameter must respect the following order:
  *         @arg @ref LL_RAMCFG_ERASE_KEY_1
  *         @arg @ref LL_RAMCFG_ERASE_KEY_2
  */
__STATIC_INLINE void LL_RAMCFG_SetEraseKey(RAMCFG_TypeDef *p_ramcfg, uint32_t key)
{
  WRITE_REG(p_ramcfg->ERKEYR, key);
}
/**
  * @}
  */

/** @defgroup RAMCFG_LL_FLAG_Management Flag_Management
  * @{
  */

/**
  * @brief  Clear the RAMCFG pending flags
  * @rmtoll ICR           CSEDC           LL_RAMCFG_ClearFlag
  * @rmtoll ICR           CDED            LL_RAMCFG_ClearFlag
  * @param  p_ramcfg RAMCFG Instance.
  * @param  flags Flag to clear.
  *         This parameter can be one of the following values:
  *            @arg @ref LL_RAMCFG_FLAG_SE  : Single Error Detected and Corrected Flag.
  *            @arg @ref LL_RAMCFG_FLAG_DE  : Double Error Detected Flag.
  *            @arg @ref LL_RAMCFG_FLAG_ALL : RAMCFG single error detected and corrected
                                              and double error detected flags.
  */
__STATIC_INLINE void LL_RAMCFG_ClearFlag(RAMCFG_TypeDef *p_ramcfg, uint32_t flags)
{
  WRITE_REG(p_ramcfg->ICR, flags);
}

/**
  * @brief  Clear the RAMCFG Single Error Detected and Corrected flag.
  * @rmtoll ICR           CSEDC           LL_RAMCFG_ClearFlag
  * @param  p_ramcfg RAMCFG Instance.
  */
__STATIC_INLINE void LL_RAMCFG_ClearFlag_SE(RAMCFG_TypeDef *p_ramcfg)
{
  WRITE_REG(p_ramcfg->ICR, LL_RAMCFG_FLAG_SE);
}

/**
  * @brief  Clear the RAMCFG Double Error Detected flag.
  * @rmtoll ICR           CDED            LL_RAMCFG_ClearFlag
  * @param  p_ramcfg RAMCFG Instance.
  */
__STATIC_INLINE void LL_RAMCFG_ClearFlag_DE(RAMCFG_TypeDef *p_ramcfg)
{
  WRITE_REG(p_ramcfg->ICR, LL_RAMCFG_FLAG_DE);
}

/**
  * @brief  Read the state of the RAMCFG flags
  * @rmtoll ISR           CSEDC           LL_RAMCFG_ClearFlag
  * @rmtoll ICR           CDED            LL_RAMCFG_ClearFlag
  * @param  p_ramcfg RAMCFG Instance.
  * @param  flags Flags to read.
  *         This parameter can be a combination of the following values:
  *           @arg @ref LL_RAMCFG_FLAG_SE       : Single Error Detected and Corrected Flag.
  *           @arg @ref LL_RAMCFG_FLAG_DE       : Double Error Detected Flag.
  *           @arg @ref LL_RAMCFG_FLAG_ALL      : RAMCFG single error detected and corrected
                                                  and double error detected flags.
              @arg @ref LL_RAMCFG_FLAG_SRAMBUSY : SRAM busy with erase operation Flag.
  * @retval State of selected flags.
            The return value can be a combination of the following values:
              @arg @ref LL_RAMCFG_FLAG_SE
              @arg @ref LL_RAMCFG_FLAG_DE
              @arg @ref LL_RAMCFG_FLAG_ALL
              @arg @ref LL_RAMCFG_FLAG_SRAMBUSY
  */
__STATIC_INLINE uint32_t LL_RAMCFG_ReadFlag(const RAMCFG_TypeDef *p_ramcfg, uint32_t flags)
{
  return READ_BIT(p_ramcfg->ISR, flags);
}

/**
  * @brief  Get the RAMCFG Single Error Detected and Corrected flag.
  * @rmtoll ISR           SEDC               LL_RAMCFG_IsActiveFlag_SE
  * @param  p_ramcfg RAMCFG Instance.
  * @return State of SE flag (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsActiveFlag_SE(const RAMCFG_TypeDef *p_ramcfg)
{
  return ((READ_BIT(p_ramcfg->ISR, LL_RAMCFG_FLAG_SE) == (LL_RAMCFG_FLAG_SE)) ? 1UL : 0UL);
}

/**
  * @brief  Get the RAMCFG Double Error Detected flag.
  * @rmtoll ISR           DED                LL_RAMCFG_IsActiveFlag_DE
  * @param  p_ramcfg RAMCFG Instance.
  * @return State of DE flag (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsActiveFlag_DE(const RAMCFG_TypeDef *p_ramcfg)
{
  return ((READ_BIT(p_ramcfg->ISR, LL_RAMCFG_FLAG_DE) == (LL_RAMCFG_FLAG_DE)) ? 1UL : 0UL);
}

/**
  * @brief  Get the RAMCFG SRAM Busy flag.
  * @rmtoll ISR           SRAMBUSY            LL_RAMCFG_IsActiveFlag_SRAMBusy
  * @param  p_ramcfg RAMCFG Instance.
  * @return State of SRAM Busy flag (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsActiveFlag_SRAMBusy(const RAMCFG_TypeDef *p_ramcfg)
{
  return ((READ_BIT(p_ramcfg->ISR, LL_RAMCFG_FLAG_SRAMBUSY) == (LL_RAMCFG_FLAG_SRAMBUSY)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup RAMCFG_LL_EF_IT_Management IT_Management
  * @{
  */

/**
  * @brief  Enable the specified RAMCFG interrupts.
  * @rmtoll IER           SEIE              LL_RAMCFG_EnableIT
  * @rmtoll IER           DEIE              LL_RAMCFG_EnableIT
  * @rmtoll IER           ECCNMI            LL_RAMCFG_EnableIT
  * @param  p_ramcfg RAMCFG Instance.
  * @param  mask Interrupt sources to enable.
  *         This parameter can be a combination of the following values:
  *           @arg @ref LL_RAMCFG_IT_SE    : Single Error Interrupt Mask.
  *           @arg @ref LL_RAMCFG_IT_DE    : Double Error Interrupt Mask.
  *           @arg @ref LL_RAMCFG_IT_NMI   : Double Error Interrupt redirection to NMI Mask.
  *           @arg @ref LL_RAMCFG_IT_ALL   : All Interrupt Mask.
  */
__STATIC_INLINE void LL_RAMCFG_EnableIT(RAMCFG_TypeDef *p_ramcfg, uint32_t mask)
{
  SET_BIT(p_ramcfg->IER, mask);
}

/**
  * @brief  Disable the specified RAMCFG interrupts.
  * @rmtoll IER           SEIE              LL_RAMCFG_DisableIT
  * @rmtoll IER           DEIE              LL_RAMCFG_DisableIT
  * @param  p_ramcfg RAMCFG Instance.
  * @param  mask Interrupt sources to disable.
  *         This parameter can be a combination of the following values:
  *           @arg @ref LL_RAMCFG_IT_SE : Single Error Interrupt Mask.
  *           @arg @ref LL_RAMCFG_IT_DE : Double Error Interrupt Mask.
  * @note   LL_RAMCFG_IT_NMI is cleared only by a global RAMCFG reset.
  */
__STATIC_INLINE void LL_RAMCFG_DisableIT(RAMCFG_TypeDef *p_ramcfg, uint32_t mask)
{
  CLEAR_BIT(p_ramcfg->IER, mask);
}

/**
  * @brief  Enable the ECC single error RAMCFG interrupt.
  * @rmtoll IER           SEIE              LL_RAMCFG_EnableIT_SE
  * @param  p_ramcfg RAMCFG Instance.
  */
__STATIC_INLINE void LL_RAMCFG_EnableIT_SE(RAMCFG_TypeDef *p_ramcfg)
{
  SET_BIT(p_ramcfg->IER, LL_RAMCFG_IT_SE);
}

/**
  * @brief  Disable the ECC single error RAMCFG interrupt.
  * @rmtoll IER           SEIE              LL_RAMCFG_DisableIT_SE
  * @param  p_ramcfg RAMCFG Instance.
  */
__STATIC_INLINE void LL_RAMCFG_DisableIT_SE(RAMCFG_TypeDef *p_ramcfg)
{
  CLEAR_BIT(p_ramcfg->IER, LL_RAMCFG_IT_SE);
}

/**
  * @brief  Check whether the ECC single error RAMCFG interrupt is enabled or not.
  * @rmtoll IER           SEIE              LL_RAMCFG_IsEnabledIT_SE
  * @param  p_ramcfg RAMCFG Instance.
  * @return State of interrupts sources (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsEnabledIT_SE(const RAMCFG_TypeDef *p_ramcfg)
{
  return ((READ_BIT(p_ramcfg->IER, LL_RAMCFG_IT_SE) == (LL_RAMCFG_IT_SE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the ECC double error RAMCFG interrupt.
  * @rmtoll IER           DEIE              LL_RAMCFG_EnableIT_DE
  * @param  p_ramcfg RAMCFG Instance.
  */
__STATIC_INLINE void LL_RAMCFG_EnableIT_DE(RAMCFG_TypeDef *p_ramcfg)
{
  SET_BIT(p_ramcfg->IER, LL_RAMCFG_IT_DE);
}

/**
  * @brief  Disable the ECC double error RAMCFG interrupt.
  * @rmtoll IER           DEIE              LL_RAMCFG_DisableIT_DE
  * @param  p_ramcfg RAMCFG Instance.
  */
__STATIC_INLINE void LL_RAMCFG_DisableIT_DE(RAMCFG_TypeDef *p_ramcfg)
{
  CLEAR_BIT(p_ramcfg->IER, LL_RAMCFG_IT_DE);
}

/**
  * @brief  Check whether the ECC double error RAMCFG interrupt is enabled or not.
  * @rmtoll IER           DEIE              LL_RAMCFG_IsEnabledIT_DE
  * @param  p_ramcfg RAMCFG Instance.
  * @return State of interrupts sources (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsEnabledIT_DE(const RAMCFG_TypeDef *p_ramcfg)
{
  return ((READ_BIT(p_ramcfg->IER, LL_RAMCFG_IT_DE) == (LL_RAMCFG_IT_DE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the ECC double error RAMCFG interrupt.
  * @rmtoll IER           ECCNMI            LL_RAMCFG_EnableIT_NMI
  * @param  p_ramcfg RAMCFG Instance.
  */
__STATIC_INLINE void LL_RAMCFG_EnableIT_NMI(RAMCFG_TypeDef *p_ramcfg)
{
  SET_BIT(p_ramcfg->IER, LL_RAMCFG_IT_NMI);
}

/**
  * @brief  Check whether the ECC NMI interrupt is enabled or not.
  * @rmtoll IER           ECCNMI            LL_RAMCFG_IsEnabledIT_NMI
  * @param  p_ramcfg RAMCFG Instance.
  * @return State of interrupts sources (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsEnabledIT_NMI(const RAMCFG_TypeDef *p_ramcfg)
{
  return ((READ_BIT(p_ramcfg->IER, LL_RAMCFG_IT_NMI) == (LL_RAMCFG_IT_NMI)) ? 1UL : 0UL);
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32U5XX_LL_RAMCFG_H */
